## ✅ Terragrunt Plan Results

**Status:** success

<details>
<summary><b>dev</b> (14 to add, 0 to change, 0 to destroy)</summary>

```hcl
Terraform will perform the following actions:
20:33:23.026 STDOUT [project-gcp-core] terraform:   # google_project.project will be created
20:33:23.026 STDOUT [project-gcp-core] terraform:   + resource "google_project" "project" {
20:33:23.026 STDOUT [project-gcp-core] terraform:       + auto_create_network = false
20:33:23.026 STDOUT [project-gcp-core] terraform:       + billing_account     = "018634-AC68FD-0FE666"
20:33:23.026 STDOUT [project-gcp-core] terraform:       + deletion_policy     = "PREVENT"
20:33:23.026 STDOUT [project-gcp-core] terraform:       + effective_labels    = {
20:33:23.026 STDOUT [project-gcp-core] terraform:           + "cost_center"                = "cc-00001"
20:33:23.026 STDOUT [project-gcp-core] terraform:           + "environment"                = "dev"
20:33:23.026 STDOUT [project-gcp-core] terraform:           + "goog-terraform-provisioned" = "true"
20:33:23.026 STDOUT [project-gcp-core] terraform:           + "managed_by"                 = "terraform"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "purpose"                    = "core-infrastructure"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "team"                       = "platform"
20:33:23.027 STDOUT [project-gcp-core] terraform:         }
20:33:23.027 STDOUT [project-gcp-core] terraform:       + id                  = (known after apply)
20:33:23.027 STDOUT [project-gcp-core] terraform:       + labels              = {
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "cost_center" = "cc-00001"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "environment" = "dev"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "managed_by"  = "terraform"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "purpose"     = "core-infrastructure"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "team"        = "platform"
20:33:23.027 STDOUT [project-gcp-core] terraform:         }
20:33:23.027 STDOUT [project-gcp-core] terraform:       + name                = "GCP Core Project"
20:33:23.027 STDOUT [project-gcp-core] terraform:       + number              = (known after apply)
20:33:23.027 STDOUT [project-gcp-core] terraform:       + project_id          = "dev-gcp-core"
20:33:23.027 STDOUT [project-gcp-core] terraform:       + terraform_labels    = {
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "cost_center"                = "cc-00001"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "environment"                = "dev"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "goog-terraform-provisioned" = "true"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "managed_by"                 = "terraform"
20:33:23.027 STDOUT [project-gcp-core] terraform:           + "purpose"                    = "core-infrastructure"
20:33:23.028 STDOUT [project-gcp-core] terraform:           + "team"                       = "platform"
20:33:23.028 STDOUT [project-gcp-core] terraform:         }
20:33:23.028 STDOUT [project-gcp-core] terraform:     }
20:33:23.028 STDOUT [project-gcp-core] terraform:   # google_project_organization_policy.policies["compute.requireOsLogin"] will be created
20:33:23.028 STDOUT [project-gcp-core] terraform:   + resource "google_project_organization_policy" "policies" {
20:33:23.028 STDOUT [project-gcp-core] terraform:       + constraint  = "compute.requireOsLogin"
20:33:23.028 STDOUT [project-gcp-core] terraform:       + etag        = (known after apply)
20:33:23.028 STDOUT [project-gcp-core] terraform:       + id          = (known after apply)
20:33:23.028 STDOUT [project-gcp-core] terraform:       + project     = "dev-gcp-core"
20:33:23.028 STDOUT [project-gcp-core] terraform:       + update_time = (known after apply)
20:33:23.028 STDOUT [project-gcp-core] terraform:       + version     = (known after apply)
20:33:23.028 STDOUT [project-gcp-core] terraform:       + boolean_policy {
20:33:23.028 STDOUT [project-gcp-core] terraform:           + enforced = true
20:33:23.028 STDOUT [project-gcp-core] terraform:         }
20:33:23.028 STDOUT [project-gcp-core] terraform:     }
20:33:23.028 STDOUT [project-gcp-core] terraform:   # google_project_organization_policy.policies["compute.skipDefaultNetworkCreation"] will be created
20:33:23.028 STDOUT [project-gcp-core] terraform:   + resource "google_project_organization_policy" "policies" {
20:33:23.028 STDOUT [project-gcp-core] terraform:       + constraint  = "compute.skipDefaultNetworkCreation"
20:33:23.028 STDOUT [project-gcp-core] terraform:       + etag        = (known after apply)
20:33:23.028 STDOUT [project-gcp-core] terraform:       + id          = (known after apply)
20:33:23.029 STDOUT [project-gcp-core] terraform:       + project     = "dev-gcp-core"
20:33:23.029 STDOUT [project-gcp-core] terraform:       + update_time = (known after apply)
20:33:23.029 STDOUT [project-gcp-core] terraform:       + version     = (known after apply)
20:33:23.029 STDOUT [project-gcp-core] terraform:       + boolean_policy {
20:33:23.029 STDOUT [project-gcp-core] terraform:           + enforced = true
20:33:23.029 STDOUT [project-gcp-core] terraform:         }
20:33:23.029 STDOUT [project-gcp-core] terraform:     }
20:33:23.029 STDOUT [project-gcp-core] terraform:   # google_project_organization_policy.policies["storage.uniformBucketLevelAccess"] will be created
20:33:23.029 STDOUT [project-gcp-core] terraform:   + resource "google_project_organization_policy" "policies" {
20:33:23.029 STDOUT [project-gcp-core] terraform:       + constraint  = "storage.uniformBucketLevelAccess"
20:33:23.029 STDOUT [project-gcp-core] terraform:       + etag        = (known after apply)
20:33:23.029 STDOUT [project-gcp-core] terraform:       + id          = (known after apply)
20:33:23.029 STDOUT [project-gcp-core] terraform:       + project     = "dev-gcp-core"
20:33:23.029 STDOUT [project-gcp-core] terraform:       + update_time = (known after apply)
20:33:23.029 STDOUT [project-gcp-core] terraform:       + version     = (known after apply)
20:33:23.029 STDOUT [project-gcp-core] terraform:       + boolean_policy {
20:33:23.029 STDOUT [project-gcp-core] terraform:           + enforced = true
20:33:23.029 STDOUT [project-gcp-core] terraform:         }
20:33:23.029 STDOUT [project-gcp-core] terraform:     }
20:33:23.029 STDOUT [project-gcp-core] terraform:   # google_project_service.apis["cloudresourcemanager.googleapis.com"] will be created
20:33:23.029 STDOUT [project-gcp-core] terraform:   + resource "google_project_service" "apis" {
20:33:23.029 STDOUT [project-gcp-core] terraform:       + disable_dependent_services = false
20:33:23.029 STDOUT [project-gcp-core] terraform:       + disable_on_destroy         = false
20:33:23.030 STDOUT [project-gcp-core] terraform:       + id                         = (known after apply)
20:33:23.030 STDOUT [project-gcp-core] terraform:       + project                    = "dev-gcp-core"
20:33:23.030 STDOUT [project-gcp-core] terraform:       + service                    = "cloudresourcemanager.googleapis.com"
20:33:23.030 STDOUT [project-gcp-core] terraform:     }
20:33:23.030 STDOUT [project-gcp-core] terraform:   # google_project_service.apis["compute.googleapis.com"] will be created
20:33:23.030 STDOUT [project-gcp-core] terraform:   + resource "google_project_service" "apis" {
20:33:23.030 STDOUT [project-gcp-core] terraform:       + disable_dependent_services = false
20:33:23.030 STDOUT [project-gcp-core] terraform:       + disable_on_destroy         = false
20:33:23.030 STDOUT [project-gcp-core] terraform:       + id                         = (known after apply)
20:33:23.030 STDOUT [project-gcp-core] terraform:       + project                    = "dev-gcp-core"
20:33:23.030 STDOUT [project-gcp-core] terraform:       + service                    = "compute.googleapis.com"
20:33:23.030 STDOUT [project-gcp-core] terraform:     }
20:33:23.030 STDOUT [project-gcp-core] terraform:   # google_project_service.apis["iam.googleapis.com"] will be created
20:33:23.030 STDOUT [project-gcp-core] terraform:   + resource "google_project_service" "apis" {
20:33:23.030 STDOUT [project-gcp-core] terraform:       + disable_dependent_services = false
20:33:23.030 STDOUT [project-gcp-core] terraform:       + disable_on_destroy         = false
20:33:23.030 STDOUT [project-gcp-core] terraform:       + id                         = (known after apply)
20:33:23.030 STDOUT [project-gcp-core] terraform:       + project                    = "dev-gcp-core"
20:33:23.030 STDOUT [project-gcp-core] terraform:       + service                    = "iam.googleapis.com"
20:33:23.031 STDOUT [project-gcp-core] terraform:     }
20:33:23.031 STDOUT [project-gcp-core] terraform:   # google_project_service.apis["logging.googleapis.com"] will be created
20:33:23.031 STDOUT [project-gcp-core] terraform:   + resource "google_project_service" "apis" {
20:33:23.031 STDOUT [project-gcp-core] terraform:       + disable_dependent_services = false
20:33:23.031 STDOUT [project-gcp-core] terraform:       + disable_on_destroy         = false
20:33:23.031 STDOUT [project-gcp-core] terraform:       + id                         = (known after apply)
20:33:23.031 STDOUT [project-gcp-core] terraform:       + project                    = "dev-gcp-core"
20:33:23.031 STDOUT [project-gcp-core] terraform:       + service                    = "logging.googleapis.com"
20:33:23.031 STDOUT [project-gcp-core] terraform:     }
20:33:23.031 STDOUT [project-gcp-core] terraform:   # google_project_service.apis["monitoring.googleapis.com"] will be created
20:33:23.031 STDOUT [project-gcp-core] terraform:   + resource "google_project_service" "apis" {
20:33:23.031 STDOUT [project-gcp-core] terraform:       + disable_dependent_services = false
20:33:23.031 STDOUT [project-gcp-core] terraform:       + disable_on_destroy         = false
20:33:23.031 STDOUT [project-gcp-core] terraform:       + id                         = (known after apply)
20:33:23.031 STDOUT [project-gcp-core] terraform:       + project                    = "dev-gcp-core"
20:33:23.031 STDOUT [project-gcp-core] terraform:       + service                    = "monitoring.googleapis.com"
20:33:23.031 STDOUT [project-gcp-core] terraform:     }
20:33:23.031 STDOUT [project-gcp-core] terraform:   # google_project_service.apis["secretmanager.googleapis.com"] will be created
20:33:23.031 STDOUT [project-gcp-core] terraform:   + resource "google_project_service" "apis" {
20:33:23.031 STDOUT [project-gcp-core] terraform:       + disable_dependent_services = false
20:33:23.031 STDOUT [project-gcp-core] terraform:       + disable_on_destroy         = false
20:33:23.031 STDOUT [project-gcp-core] terraform:       + id                         = (known after apply)
20:33:23.031 STDOUT [project-gcp-core] terraform:       + project                    = "dev-gcp-core"
20:33:23.031 STDOUT [project-gcp-core] terraform:       + service                    = "secretmanager.googleapis.com"
20:33:23.031 STDOUT [project-gcp-core] terraform:     }
20:33:23.031 STDOUT [project-gcp-core] terraform:   # google_project_service.apis["serviceusage.googleapis.com"] will be created
20:33:23.031 STDOUT [project-gcp-core] terraform:   + resource "google_project_service" "apis" {
20:33:23.031 STDOUT [project-gcp-core] terraform:       + disable_dependent_services = false
20:33:23.032 STDOUT [project-gcp-core] terraform:       + disable_on_destroy         = false
20:33:23.032 STDOUT [project-gcp-core] terraform:       + id                         = (known after apply)
20:33:23.032 STDOUT [project-gcp-core] terraform:       + project                    = "dev-gcp-core"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + service                    = "serviceusage.googleapis.com"
20:33:23.032 STDOUT [project-gcp-core] terraform:     }
20:33:23.032 STDOUT [project-gcp-core] terraform:   # google_service_account.service_accounts["dev-gcp-core-sa"] will be created
20:33:23.032 STDOUT [project-gcp-core] terraform:   + resource "google_service_account" "service_accounts" {
20:33:23.032 STDOUT [project-gcp-core] terraform:       + account_id   = "dev-gcp-core-sa"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + description  = "Primary SA for core infrastructure"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + disabled     = false
20:33:23.032 STDOUT [project-gcp-core] terraform:       + display_name = "GCP Core Service Account"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + email        = "dev-gcp-core-sa@dev-gcp-core.iam.gserviceaccount.com"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + id           = (known after apply)
20:33:23.032 STDOUT [project-gcp-core] terraform:       + member       = "serviceAccount:dev-gcp-core-sa@dev-gcp-core.iam.gserviceaccount.com"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + name         = (known after apply)
20:33:23.032 STDOUT [project-gcp-core] terraform:       + project      = "dev-gcp-core"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + unique_id    = (known after apply)
20:33:23.032 STDOUT [project-gcp-core] terraform:     }
20:33:23.032 STDOUT [project-gcp-core] terraform:   # time_sleep.api_activation will be created
20:33:23.032 STDOUT [project-gcp-core] terraform:   + resource "time_sleep" "api_activation" {
20:33:23.032 STDOUT [project-gcp-core] terraform:       + create_duration = "30s"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + id              = (known after apply)
20:33:23.032 STDOUT [project-gcp-core] terraform:     }
20:33:23.032 STDOUT [project-gcp-core] terraform:   # time_sleep.project_creation will be created
20:33:23.032 STDOUT [project-gcp-core] terraform:   + resource "time_sleep" "project_creation" {
20:33:23.032 STDOUT [project-gcp-core] terraform:       + create_duration = "30s"
20:33:23.032 STDOUT [project-gcp-core] terraform:       + id              = (known after apply)
20:33:23.032 STDOUT [project-gcp-core] terraform:     }
20:33:23.032 STDOUT [project-gcp-core] terraform: Plan: 14 to add, 0 to change, 0 to destroy.
20:33:23.032 STDOUT [project-gcp-core] terraform: 
20:33:23.032 STDOUT [project-gcp-core] terraform: Changes to Outputs:
20:33:23.032 STDOUT [project-gcp-core] terraform:   ~ labels           = {
20:33:23.032 STDOUT [project-gcp-core] terraform:       ~ cost_center = "CC-00001" -> "cc-00001"
20:33:23.032 STDOUT [project-gcp-core] terraform:         # (4 unchanged attributes hidden)
20:33:23.032 STDOUT [project-gcp-core] terraform:     }
20:33:23.032 STDOUT [project-gcp-core] terraform:   + project_number   = (known after apply)
20:33:23.032 STDOUT [project-gcp-core] terraform:   + service_accounts = {
20:33:23.032 STDOUT [project-gcp-core] terraform:       + dev-gcp-core-sa = {
20:33:23.032 STDOUT [project-gcp-core] terraform:           + email = "dev-gcp-core-sa@dev-gcp-core.iam.gserviceaccount.com"
20:33:23.033 STDOUT [project-gcp-core] terraform:           + id    = "dev-gcp-core-sa"
20:33:23.033 STDOUT [project-gcp-core] terraform:           + name  = (known after apply)
20:33:23.033 STDOUT [project-gcp-core] terraform:         }
20:33:23.033 STDOUT [project-gcp-core] terraform:     }
20:33:23.033 STDOUT [project-gcp-core] terraform: 
20:33:23.033 STDOUT [project-gcp-core] terraform: ─────────────────────────────────────────────────────────────────────────────
20:33:23.033 STDOUT [project-gcp-core] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
20:33:23.033 STDOUT [project-gcp-core] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

